{
  "irVersion": "1.0",
  "project": "VersionConductor",
  "repository": "https://github.com/plexusone/versionconductor",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Dependency graph analysis for multi-org module relationships" },
        { "description": "Graph visualization in DOT (Graphviz) and Mermaid formats" },
        { "description": "Repository moved to plexusone GitHub organization" }
      ],
      "added": [
        { "description": "Dependency graph package for analyzing module relationships", "commit": "c343cb2" },
        { "description": "go.mod parser with support for require, replace, and exclude directives", "commit": "c343cb2" },
        { "description": "Graph builder to fetch and analyze modules from GitHub repos", "commit": "c343cb2" },
        { "description": "Topological sort for correct upgrade ordering", "commit": "c343cb2" },
        { "description": "Multi-org portfolio support with org and language filtering", "commit": "c343cb2" },
        { "description": "CLI commands: `graph build`, `graph dependents`, `graph dependencies`, `graph order`, `graph stale`, `graph stats`", "commit": "75517d8" },
        { "description": "CLI command: `graph visualize` with DOT and Mermaid format options", "commit": "79ea908" },
        { "description": "Caching layer with memory and file backends, TTL support", "commit": "31b17c1" },
        { "description": "Rate limiting with automatic retry via `mogo/net/http/retryhttp`", "commit": "3753a0b" },
        { "description": "Cache CLI options: `--cache`, `--cache-dir`, `--cache-ttl`, `--no-cache`", "commit": "114ad7f" },
        { "description": "Progress reporting for graph build operations", "commit": "79ea908" }
      ],
      "changed": [
        { "description": "Repository moved from `grokify/versionconductor` to `plexusone/versionconductor`", "commit": "6dd321a" }
      ],
      "documentation": [
        { "description": "GitHub token permissions table in README", "commit": "ab546d5" },
        { "description": "Multi-org portfolio management design", "commit": "27ab430" },
        { "description": "Multi-language support design with Language enum and ManifestParser interface", "commit": "27ab430" },
        { "description": "Git repo storage design for dependency graph persistence", "commit": "27ab430" }
      ],
      "testing": [
        { "description": "Unit tests for go.mod parser (require blocks, replace, exclude, comments)", "commit": "519c644" },
        { "description": "Unit tests for graph algorithms (dependents, dependencies, topological sort)", "commit": "519c644" },
        { "description": "Unit tests for filtering by org and language", "commit": "519c644" },
        { "description": "Unit tests for cache (memory, file, expiration, pruning)", "commit": "31b17c1" },
        { "description": "Unit tests for DOT/Mermaid visualization (clustering, external deps, escaping)", "commit": "79ea908" },
        { "description": "Integration tests with mocked GitHub API", "commit": "bb92b59" }
      ],
      "dependencies": [
        { "description": "Upgrade `github.com/google/go-github` to v84", "commit": "88fce86" },
        { "description": "Upgrade `github.com/grokify/gogithub` to v0.12.1", "commit": "dab1263" },
        { "description": "Upgrade `github.com/grokify/mogo` to v0.74.2", "commit": "fc96df0" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-31",
      "highlights": [
        { "description": "Automated dependency PR management across multiple GitHub organizations" },
        { "description": "Policy-based auto-review and merge of Renovate/Dependabot PRs" },
        { "description": "Maintenance release creation with semantic version bumping" }
      ],
      "added": [
        { "description": "CLI with `scan`, `review`, `merge`, `release`, and `version` commands using Cobra framework", "commit": "1c1e14b" },
        { "description": "GitHub collector for dependency PR discovery across organizations", "commit": "1c1e14b" },
        { "description": "Detection of Renovate and Dependabot PRs by author identification", "commit": "1c1e14b" },
        { "description": "PR metadata extraction including dependency name, versions, and update type", "commit": "1c1e14b" },
        { "description": "Cedar policy engine for auto-merge decisions", "commit": "1c1e14b" },
        { "description": "Three built-in merge profiles: `aggressive`, `balanced`, `conservative`", "commit": "1c1e14b" },
        { "description": "PR merger with squash, merge, and rebase strategies", "commit": "1c1e14b" },
        { "description": "Release creator with semantic version bumping (patch releases)", "commit": "1c1e14b" },
        { "description": "JSON and Markdown report formats", "commit": "1c1e14b" },
        { "description": "Dry-run mode for all write operations", "commit": "1c1e14b" },
        { "description": "Example Cedar policy for auto-merge patch updates", "commit": "6646bb9" }
      ],
      "documentation": [
        { "description": "README with installation, usage, and examples", "commit": "fab419e" },
        { "description": "CHANGELOG with structured format", "commit": "fab419e" },
        { "description": "Release notes for v0.1.0", "commit": "fab419e" },
        { "description": "PRD, MRD, and TRD product documents", "commit": "dbb255c" },
        { "description": "Dependency graph feature specification", "commit": "9050c0f" },
        { "description": "Scheduled graph upgrades and release propagation", "commit": "952edb0" },
        { "description": "Comprehensive ROADMAP with prioritized milestones", "commit": "d509923" }
      ],
      "dependencies": [
        { "description": "`github.com/google/go-github/v82` for GitHub API", "commit": "e5670fd" },
        { "description": "`github.com/grokify/gogithub` v0.7.0 for GitHub API helpers", "commit": "e5670fd" },
        { "description": "`github.com/spf13/cobra` v1.10.2 for CLI framework", "commit": "e5670fd" },
        { "description": "`github.com/spf13/viper` v1.21.0 for configuration management", "commit": "e5670fd" }
      ],
      "chores": [
        { "description": "Initial project setup with go.mod, LICENSE, and CI workflow", "commit": "e5670fd" }
      ]
    }
  ]
}
